## Reading files with Python

In [2]:
import pandas as pd

When you want to work with a file, the first thing to do is to open it. This is done by invoking the `open()` built-in function.

`open()` has a single required argument that is the path to the file and has a single return, the file object.

The `with` statement automatically takes care of closing the file once it leaves the `with` block, even in cases of error.

In [1]:
filepath = '../data/btc-market-price.csv'

with open(filepath, 'r') as reader:
    print(reader)

<_io.TextIOWrapper name='../data/btc-market-price.csv' mode='r' encoding='cp1252'>

Once the file is opened, we can read its content as follows:

In [ ]:
with open(filepath, 'r') as reader:
    for index, line in enumerate(reader.readlines()):
        if(index < 10): # reading just the 10 first lines
            print(index, line)

The `read_csv` function is extremely powerful and you can specify a very broad set of parameters at import time that allow us to accurately configure how the data will be read and parsed by specifying the correct structure, encoding and other details. The most common parameters are as follows:

- `filepath`: Path of the file to be read.
- `sep`: Character(s) that are used as a field separator in the file.
- `header`: Index of the row containing the names of the columns (None if none).
- `index_col`: Index of the column or sequence of indexes that should be used as index of rows of the data.
- `names`: Sequence containing the names of the columns (used together with header = None).
- `skiprows`: Number of rows or sequence of row indexes to ignore in the load.
- `na_values`: Sequence of values that, if found in the file, should be treated as NaN.
- `dtype`: Dictionary in which the keys will be column names and the values will be types of NumPy to which their content must be converted.
- `parse_dates`: Flag that indicates if Python should try to parse data with a format similar to dates as dates. You can enter a list of column names that must be joined for the parsing as a date.
- `date_parser`: Function to use to try to parse dates.
- `nrows`: Number of rows to read from the beginning of the file.
- `skip_footer`: Number of rows to ignore at the end of the file.
- `encoding`: Encoding to be expected from the file read.
- `squeeze`: Flag that indicates that if the data read only contains one column the result is a Series instead of a DataFrame.
- `thousands`: Character to use to detect the thousands separator.
- `decimal`: Character to use to detect the decimal separator.
- `skip_blank_lines`: Flag that indicates whether blank lines should be ignored.

`read_csv()` can also read files through a URL:

In [4]:
csv_url = "https://raw.githubusercontent.com/datasets/gdp/master/data/gdp.csv"

pd.read_csv(csv_url).head()

  Country Name Country Code  Year         Value
0   Arab World          ARB  1968  2.576068e+10
1   Arab World          ARB  1969  2.843420e+10
2   Arab World          ARB  1970  3.138550e+10
3   Arab World          ARB  1971  3.642691e+10
4   Arab World          ARB  1972  4.331606e+10

### Using the parameters in `read_csv()`

In [ ]:
df = pd.read_csv('../data/btc-market-price.csv',
                 header=None, # shows to pandas this file has no header
                 na_values=['', '?', '-'], # values that should be treated as NA
                 names=['Timestamp', 'Price'], # Naming the columns
                 dtype={'Price': 'float'}, # Setting a dtype to the header 'Price'
                 parse_dates=[0], # Parsing column 0 to date
                 index_col=[0] # Setting column 0 as index
)
df.head(3)

### A more challenging parsing

In [10]:
exame_df = pd.read_csv('../data/exam_review.csv',
                       sep='>') # Setting the separator 
exame_df

  first_name last_name  age math_score french_score
0        Ray    Morley   18     68,000       75,000
1     Melvin     Scott   24         77           83
2     Amirah     Haley   22         92           67
3     Gerard     Mills   19     78,000           72
4        Amy    Grimes   23         91           81

In [11]:
exame_df[['math_score', 'french_score']].dtypes

math_score      object
french_score    object
dtype: object

We have to fix the data types

In [12]:
exame_df = pd.read_csv('../data/exam_review.csv',
                       sep='>', # Setting the separator 
                       decimal=','# Setting the decimal separator
)
exame_df[['math_score', 'french_score']].dtypes

math_score      float64
french_score    float64
dtype: object

Allowing blank lines

In [14]:
pd.read_csv('../data/exam_review.csv',
            sep='>',
            skip_blank_lines=False)

  first_name last_name   age math_score french_score
0        Ray    Morley  18.0     68,000       75,000
1     Melvin     Scott  24.0         77           83
2     Amirah     Haley  22.0         92           67
3        NaN       NaN   NaN        NaN          NaN
4     Gerard     Mills  19.0     78,000           72
5        Amy    Grimes  23.0         91           81

If you want to load specific columns:

In [15]:
pd.read_csv('../data/exam_review.csv',
            usecols=['first_name', 'last_name', 'age'],
            sep='>')

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23

### Saving to csv file

In [16]:
exame_df.to_csv('../data/exam_df_saved.csv',
                index=None # removes the index column so, when it's going to be read again, this column is not duplicated
                )